list = [ 18, 14, 10, 6, 2 ]
# Вывести список на экран

for i in range(len(list)):
    print(list[i])

